OpenFOAM_Examples/Quasi_DNS_Dowtherm_Mixed_Conv/flamePropagationWithObstacles/0.orig/B
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      B;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor>
8025
(
(1.785697 0 0 1.785697 0 1.875)
(1.577364 0 0 1.577364 0 1.666667)
(1.622015 0 0 1.622015 0 1.666667)
(1.853867 0 0 0.713867 0 0.875)
(0.928867 0 0 0.607067 0 0.833334)
(1.577364 0 0 1.577364 0 1.666667)
(1.666667 0 0 1.666667 0 1.666667)
(1.622015 0 0 1.622015 0 1.666667)
...
)
;

boundaryField
{
    outer
    {
        type                uniformInletOutlet;
        uniformInletValue   (0 0 0 0 0 0);
        value               uniform (0 0 0 0 0 0);
    }
    ground
    {
        type            zeroGradient;
    }
    blockedFaces
    {
        type            zeroGradient;
        value           uniform (0 0 0 0 0 0);
    }
    baffleWall
    {
        type            zeroGradient;
        value           uniform (0 0 0 0 0 0);
    }
    baffleCyclic_half0
    {
        type            cyclic;
    }
    baffleCyclic_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
