OpenFOAM_Examples/Quasi_DNS_Dowtherm_Mixed_Conv/flamePropagationWithObstacles/0.orig/Xi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Xi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    outer
    {
        type                uniformInletOutlet;
        uniformInletValue   1;
        value               uniform 1;
    }
    ground
    {
        type            zeroGradient;
    }
    blockedFaces
    {
        type            zeroGradient;
        value           uniform 1;
    }
    baffleWall
    {
        type            zeroGradient;
        value           uniform 1;
    }
    baffleCyclic_half0
    {
        type            cyclic;
    }
    baffleCyclic_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
