OpenFOAM_Examples/Quasi_DNS_Dowtherm_Mixed_Conv/flamePropagationWithObstacles/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict.1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    blockedFacesSet;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (1 1 0.99) (2 2 1);
    }

    {
        name    blockedCellsSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (2.4 2.4 0) (3 3 1);
    }

    {
        name    blockedCellsSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0 0 0) (0.6 0.6 1);
    }

    {
        name    blockedFacesSet;
        type    faceSet;
        action  add;
        source  cellToFace;
        set     blockedCellsSet;
        option  all;
    }

    {
        name    coupledFacesSet;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (1.0 1.99 0) (2.0 2.09 0.6);
    }

);

// ************************************************************************* //
